[
  {
    "id": "FSA-2020-0004-0390",
    "comment": "<br/><br/>I am not sure who the CFAP program is intended to assist, but I can assure you that producers in the Southern Plains are not seeing any of it.<br/><br/>For example:<br/><br/>1. The only farm commodity that might possibly qualify is cotton that a producer held over and did not sell until after Jan 15.&nbsp; With harvest occurring in October and November, a very small percentage was left to sell.<br/><br/>2.&nbsp; The Southern Plains is the leading area for wheat pasture graze out producing a significant percentage of the beef going to finishing lots. These cattle do not market until very late April and May, so they were left out of the program. However, they were the most impacted by the crashing fat cattle market due to the packing houses closing because of COVID-19.<br/><br/>3.&nbsp; The breeding stock operations normally sell the bulk of their production on &quot;special breeding stock sales&quot; during late March and April. Due to COVID-19 these sales were all postponed until May.&nbsp; Again, these producers were left out of the program.<br/><br/>I am most appreciative of any agriculture producers being assisted and I truly hope the suffering operations receive relief that they need.<br/><br/>However, it seems it was intended to only help a select group. Administering an arbitrary date previous to a specific regional market that eliminated them from the program does not provide equal opportunity.<br/><br/>Any attention that you could give to this issue would be greatly appreciated.<br/><br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0368",
    "comment": "On behalf of the National Association of Egg Farmers representing shell egg and liquid egg farmers, we are pleased to offer comments on the Coronavirus Food Assistance Program &quot;additional commodities request for information&quot; as requested by the Farm Service Agency (FSA-2020-0004-003). <br/><br/>Beginning May 26th, farmers were able to file for aide from the Coronavirus Food Assistance Program. At that time egg farmers producing liquid egg for foodservice establishments were excluded because liquid egg and shell egg farmers were combined into a single category with the statement  &ldquo;Commodities that did not suffer a five percent-or-greater price decline from mid-January 2020 to mid-April 2020 are not eligible for CFAP. Specifically, this includes sheep more than two years old, eggs/layers, soft red winter wheat, hard red winter wheat, white wheat, rice, flax, rye, peanuts, feed barley, Extra Long Staple (ELS) cotton, alfalfa, forage crops, hemp, and tobacco. USDA may reconsider the excluded commodities if credible evidence is provided that supports a five percent price decline.&rdquo; <br/><br/>We appreciate that USDA stated they may reconsider the excluded commodities (eggs/layers) if credible evidence is provided that supports a five percent price decline. National Association of Egg Farmers offers the following evidence supporting its claim of a five percent decline. The egg market has two distinct markets, shell eggs and egg products. These two distinct types of laying hen farms utilize different processes and equipment to supply their customers. In fact, the shell egg market experienced a short-lived spike while the liquid egg market fell to a record low. For distinction between the various markets for eggs, the following prices were gathered from UDSA data between mid-Jan and mid-April 2020:  <br/>Liquid egg price decreased from $0.25 to $0.08 per pound<br/>Dried egg price decreased from $2.15 to $2.02 per pound<br/>Shell egg price increased from $0.79 to $1.79 per dozen<br/><br/>Because these farms, processes, and markets are not interchangeable, this fact sheet focuses on the egg product market. <br/><br/>&bull; Commodities are required to have a 5% decline in price from mid-January to mid-April to qualify their farmers for the Coronavirus Food Assistance Program. USDA data for processed (liquid) egg shows that the price in mid-Jan 2020 was $0.2465 per pound and in mid-April it was $0.0771 per pound. This 68.7% price decline is significantly greater than the 5% price decline threshold required to qualify for the CFAP program. Because USDA data is not complete, other sources can be used to verify the accuracy of this information. Urner-Barry reported a 59% decrease from $0.270 per pound to $0.112 per pound during the same time frame. Both sources support a finding that this commodity has suffered more than a 5% loss in market value. <br/><br/>&bull; USDA data from the Weekly Shell Eggs Processed Under Federal Inspection Report shows that liquid edible egg production is the lowest it has been since December 2009. The five-week running average of edible liquid egg production by mid-May 2020, was 29% lower than the same period of 2019 and the lowest since January 2004. <br/>&bull; FDA created a temporary pathway to move eggs from the liquid market into the shell egg market; however, this wasn&rsquo;t applicable to many farmers because 1) their flocks were ineligible due to a requirement for hen age less than 45 weeks, 2) eggs could not be packaged with equipment that was available, and 3) retailers were generally not willing to accept alternative egg packaging. <br/>&bull; Many customers imposed the force majeure clause in their contracts and stopped taking delivery of egg products. As a result, egg farmers needed to dispose of liquid egg product through unpaid channels. <br/>&bull; While liquid egg can be dried for longer shelf life, dried egg product inventories at the time of the COVID outbreak were close to an all-time high. This, along with limited dryer capacity and increased cost, limited liquid egg supplies being converted into dried egg as a viable option. <br/>&bull; Some farmers were able to molt their flocks to temporarily reduce egg production. Flocks molted at the beginning of the COVID-19 outbreak are coming back into full egg production while the market is still low. <br/>&bull; The national flock size has dropped by almost six million layers during April in addition to the 10 million laying hen reduction during the first quarter of 2020. National Association of Egg Farmers urges the FSA and AMS help these egg farmers utilize the provisions in CFAP since they too lost more than five percent of their value during COVID19.<br/>Thank you.<br/>Ken Klippen, President<br/>National Association of Egg Farmers<br/><br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0447",
    "comment": "I am currently going through a really rough time with my agricultural business. I am mainly a Pima cotton grower and can not believe that my crop was not included in as an eligible commodity. I have lost a substantial amount of money starting with my 2018 crop due to tariffs imposed on my cotton and can`t even sell my crop to China, Vietnam and other countries because of the Covid 19. That is due to the fact that the cotton mills are shut down. Meanwhile I am being charged storage fees that ad up to be probably 10 cents a pound. This is a more than a 5% loss not including the loss in price since the beginning  of the year",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0432",
    "comment": "We are ELS Cotton (PIMA) growers in central california. Our 2019 crop was greatly affected by the Covid-19 virus around the world. Due to lock downs of exports around the world, our prices felled between 25% and 40% of the price average we had received over the past 10 years.  As you probably know, all expenses during this time have also continued to increase.  I have noticed that there is an assistance program for upland cotton but not for pima cotton, and was wondering if there might be something you can do to assist us during these tough times ?  Thanks, Stephen Mark Barlow partner WESTBASE FARMS &amp; BARLOW FAMILY FARMS",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-0432/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-0646",
    "comment": "Can you please include alfalfa and Pima cotton as these essential commodities took a tremendous hit to our bottom line",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0686",
    "comment": "Gentlemen,<br/>I am 93 years old and the family that rent my ground have been growing Pima Cotton for a long time.. My 2 sources of income are my rent from Cotton and <br/>my social security.  I have always bought Cotton clothes so that I am helping the Cotton Industry and cotton products are all natural and long lasting.. Please consider all the families that need your help to get through this troubling times...<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0685",
    "comment": "We are sending you a note to ask that you please put us on the Food Assistance Program.. There has been no money coming in and Pima Cotton is the premium Cotton grown in the area.. We only grow Cotton and no other commodity and really would appreciate being included in payment. I have been farming my entire life and Cotton is our number 1 business and our only source of income..<br/><br/>Thank You,  Jack &amp; Pat Jones",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0687",
    "comment": "I have been growing Pima cotton for 15 years and it has been profitable until 2018. Then the tariff war began. I lost 30 cents a pound on my crop which equates to a $200000 dollar loss! I kept waiting for China to lift the tariff but they haven`t done what they have promised and since the china virus I still have 325 cotton bales to sell. You can`t sell them because the cotton mills in China are shut down. In the mean time I am paying storage fees every month and the interest that I am paying to my bank is excessive. I was floored when I heard Pima cotton was considered an ineligible commodity. I just can`t believe it!",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0697",
    "comment": "See attached file(s). We are a family farm in California and we urge the USDA to designate ELS cotton as a CFAP eligible Non-Specialty Crop. Thank you for your consideration.",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-0697/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-0694",
    "comment": "We are a small family owned, third generation farming operation located in Dos Palos, Ca. Our operational funds have strongly been affected by the onset of Covid 19. We have been unable to successfully market our Pima cotton. ESL cotton exports have virtually stalled since March while shipments have dropped significantly in mid-April. There has been a decline in ESL market prices between Jan. 2020 and April 2020 by $0.08 per pound or 7.2% between Jan. and April. The latest price decline meets the 5% threshold established by CFAP over the appropriate timeframe. Given the current economic situation, ESL producers, like ourselves, are in dire need of the timely assistance that can be provided through CFAP. ",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0717",
    "comment": "We would like to urge the USDA to designate ELS cotton as a CFAP eligible Non-specialty crop.  As ELS cotton growers in California, we have been significantly impacted by the commodity price drop due to COVID-19.  Our family farm has been farming ELS cotton for 40 years in California&#39;s Central valley.  Three generations of our family have dedicated our lives to farming.  We provide jobs for families in our small community.  We farmed 1200 acres of ELS cotton in the 2019 crop year.  The costs to farm cotton have increased due to increased water costs, labor costs, storage costs, and other input costs such as; seed, fertilizer and insecticides.  In good times, our profit margin is tight for ELS cotton and in this current economic crisis, it is impossible to support our 2020 growing crops without assistance.  <br/>We believe ELS cotton should be considered for program assistance for the following reason:<br/>1. The COVID-19 pandemic has resulted in significant loss in demand for ELS cotton.  The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>2. This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interests costs.<br/>3. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April.<br/>4. Trade data published by U.S. Census Bureau indicate a decline in ELS market prices between January 2020 and April 2020.  ELS cotton prices, as measured by per-pound export values declined by $.08 per pound, or 7.2% between January and April.<br/>5.  The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe.<br/>6.  With decreased demand and delayed shipments, growers are facing higher storage and interest charges.  When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents.<br/><br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0732",
    "comment": "Attached are the comments from the California Cotton Ginners and Growers Association.<br/><br/>Sincerely,<br/><br/>Roger A. Isom<br/>President/CEO",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-0732/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-0740",
    "comment": "Attached please find two letters regarding CFAP funding for ELS (Pima) growers.<br/><br/>Regards,<br/><br/>Gil Jones<br/>Valley Gin-Tornillo, TX<br/> ",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-0740/attachment_1.pdf",
      "https://downloads.regulations.gov/FSA-2020-0004-0740/attachment_2.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-0735",
    "comment": "Re: ELS cotton as a CFAP Eligible Non-Specialty Crop<br/><br/>To Whom it may concern :<br/><br/>I am a third generation farmer in Kern County California and I am writing to request that the USDA designate ELS cotton as a CFAP Non-Speciality Crop. My name is Tom Toretta and I am one of the partner/owners of Toretta Farms, I am also on the Board of Directors at  Farmers Co-Op Gin in Kern County and Ranchers Cotton Oil, a cotton seed marketing Co-Op. ELS cotton is one of the main crops produced by growers in our area and is very important financially to the economy in our area.  The recent COVID-19 pandemic crisis has negatively affected not only the ELS market but ag commodities as a whole. Because of the COVID crisis there has been a loss in demand for ELS cotton, since the retail apparel industry has also suffered from the COVID crisis they are not buying our cotton, this has resulted in larger carryover stocks. . 2.Storage and interest cost have increased due to lack of demand for ELS cotton, as the export markets for ELS cotton have virtually been stalled resulting in cotton have to stay in storage longer. 3. U.S. Census Bureau data indicates a decline in ELS prices of $0.08 per pound or or 7.2% between January and April, this decline meets the  5% price decrease threshold and timeframe threshold by the CFAP. All of these factors and the current economic climate means that ELS producers are in need of CFAP assistance. <br/><br/>Thank you,<br/>Tom Toretta<br/><br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0731",
    "comment": "We urge the USDA to designate ELS Pima cotton as a CFAP eligible non specialty crop.<br/><br/>We market ELS pima cotton for hundreds of growers in the U.S.   We have been in business for 77 years, located<br/>in the heart of ELS Pima production, Bakersfield, California. <br/><br/>*The Covid-19 pandemic has resulted in a significant loss in demand for ELS cotton.  This is evident in slowdown<br/>and drop of 92% demand comparing average Jan 2020 net sales of 16,205 bales vs. April 2020 net sales of 1,370 bales per the USDA export sales report.  This massive slowdown has resulted in an increase in carryover stocks projected to increase by 34% vs. the previous year.<br/><br/>*Prices have been in a free fall for two years by 22% and continued during the January 2020&ndash; April 2020 time period.  Export trade data published by the U.S. Census Bureau indicate a decline in ELS market prices between January 2020 &ndash; April 2020 of <br/>8.00c/lb or 7.2%.   Storage and interest charges are not forgiven for ELS cotton and continue to accrue against the ELS Pima <br/>grower of 3.00c/lb during the January 2020-April 2020 time period taking the overall price decline to 11.00c/lb or 9.9%.<br/><br/>This is by far the worst year ever for ELS pima cotton we have ever seen in our existence.  1-ELS pima prices<br/>are below production costs.  2-Growers cannot pay back farm loans.   3-ELS pima will be forfeited,<br/>a first since the early 1990s as there is not enough buyers for their cotton due to demand destruction.  4-Many growers will be forced out of business. <br/><br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.<br/>All the above comments not only meet the 5% price decline threshold in CFAP over the appropriate time frame, but<br/>FAR exceeds it.<br/><br/>Respectfully submitted,<br/>Jess Smith &amp; Sons Cotton Co.<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0734",
    "comment": "RE: Designation of ELS cotton as a CFAP Eligible Non-Specialty Crop<br/>To whom it may concern:<br/>I am writing today to request that the USDA designate ELS cotton as a CFAP eligible Non-Specialty Crop. My<br/>name is Cannon Michael and I am the president of my family&rsquo;s farming operation in the Central Valley of<br/>California. We are a 6 generation California farm family and have been farming the same land for over 160<br/>years. ELS cotton is one of our primary crops along with tomatoes and other annual crops. During the COVID<br/>crisis there has been considerable focus on our food supply yet many of us grow food and fiber crops in our<br/>rotations. While we all enjoy using cotton in our daily lives, much of it is produced in regions that don&rsquo;t protect<br/>their workers or environment. California has high regulatory standards with enforceable penalties that back<br/>them up. The COVID crisis has disrupted the markets for many agricultural commodities and ELS cotton has<br/>been impacted as well.<br/>I believe that ELS cotton should be designated as a CFAP eligible Non-Sprecialty crop for the following<br/>reasons:<br/>● The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel<br/>industry has been completely disrupted because of the COVID-19 pandemic.<br/>● This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage<br/>and interest costs.<br/>● ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in<br/>mid-April.<br/>● Trade data published by U.S. Census Bureau indicates a decline in ELS market prices between January<br/>2020 and April 2020. ELS cotton prices, as measured by per-pound export values declined by $0.08 per<br/>pound, or 7.2% between January and April.<br/>● The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe.<br/>● With decreased demand and delayed shipments, growers are facing higher storage and interest charges.<br/>When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing<br/>costs is 10.7 cents.<br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be<br/>provided through CFAP. Thank you for your consideration.<br/>Sincerely,<br/>Matthew E. Diener, President<br/>Five Points Ranch",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0741",
    "comment": "I am in favor of this financial aide because the market has gone below cost of production for pima long staple cotton.  The reason the market has dropped is because of the covid virius and also the governments actions against the Chinese which is our largest customer.  At the government loan rate of 96 cents per pound we need a yield ofl 1823 pounds per acre.  This is possible only on rare occasions.  Please treat us like our  upland growers, our price though higher follows the upland cotton market.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0733",
    "comment": "My brother and I operate a small farming operation that grows pima cotton (ELS cotton), we are second generation producers and our financial situation has been drastically effected by the CORONA virus.  Once the pandemic became global all of the mills that spin our product world wide were disrupted and demand went to zero overnight.  Our broker currently has cotton stuck in sea ports all over the world that cant move and hasn&#39;t been paid for.  There has been a significant change in price for pima cotton and an even greater drop in demand which has halted any potential sale.  We would greatly appreciate the ability to have our crop be considered for the CFAP program so we can have access to relief that many other farms and ranches are being able to utilize.  Thank you for your consideration. ",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0743",
    "comment": "Attached please find a letter from an ELS (Pima) producer urging the addition of ELS cotton to CFAP funding.<br/><br/>Regards,<br/><br/>Gil Jones<br/>Valley Gin-Tornillo, TX",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-0743/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-0757",
    "comment": "ELS Cotton &amp; Raisins are both affected as much if not more for the drop in prices. Please add to list of crops for CFAP PMT.<br/>Regards ,  Robert Jones , Robert Jones Farms  Fresno County CA",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0778",
    "comment": "Re: ELS cotton as a CFAP Eligible Non-Specialty Crop<br/><br/>To Whom it may concern:<br/><br/>My wife and I are 2nd generation family farmers ,our son and grandsons are also involved in the family business. We are a row and tree crop farm located in Kern County California, ELS cotton is one of the crops we grow. We are asking that ELS cotton be designated CFAP eligible non-specialty crop. Due to the COVID-19 pandemic agricultural commodities, including ELS cotton have been negatively affected. Because of a loss of demand created by COVID-19  for ELS cotton we are experiencing larger carry over stocks resulting in increased storage and interest costs as export sales have stalled and shipments have stopped. Data published by the U.S. Census Bureau indicates there has been a decline of $0.08 per pound or 7.2% between January and April in the price of ELS cotton. We believe the latest price decline meets the 5% threshold required by CFAP for designation as an eligible non-specialty crop.<br/><br/>Thank you,<br/>Don and Donna Toretta<br/>Toretta Farms",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0773",
    "comment": "Please see the attached letters encouraging the expansion of CFAP eligibility to include ELS (Pima) cotton.<br/><br/>Regards,<br/>Gil Jones<br/>Valley Gin Company-Tornillo, TX",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-0773/attachment_1.pdf",
      "https://downloads.regulations.gov/FSA-2020-0004-0773/attachment_2.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-0851",
    "comment": "My name is Kirk Gilkey.  I am a third generation farmer in Corcoran California.  My family farm started growing Pima (American ELS) cotton in the middle 1990&#39;s.  It has been a good crop for my family farms that  also grows wheat, safflower, pistachios, and wine grapes among other crops.  The demand for Pima has seriously dropped since the Covid19 crisis has been recognized around the world.  Demand for Pima has been greatly diminished due to Covid19.. Shipments of ELS have almost stopped during this Covid19 pandemic.  This results in higher carryover stocks, higher storage and interest charges.  Growers like my family face very uncertain times especially in California where intense government regulation lead to the highest production costs in world for crops.  Please consider the trade data published by the US Census Bureau indicate a decline in ELS market prices of $.08 per pound or a 7.25% decline between January 2020 and April 2020.  This decline meets the threshold for eligibility for ELS into the CFAP.  Please designate ELS cotton an eligible CFAP Specialty Crop.  Thank you for you consideration!!",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0825",
    "comment": "<br/>RE: Designation of ELS cotton as a CFAP Eligible Non- Specialty Crop<br/><br/>To whom it may concern,<br/><br/>My name is Kelly Deftereos and I am a 3rd generation farmer in Hanford, California.  We are a small family farm of 300 acres with no employees and currently grow supima cotton, alfalfa, corn, wheat and pistachios.<br/><br/>As we all know the COVID 19 pandemic has had a profound effect on most, if not all, aspects of agriculture; but I write you today to address the concerns of the USDA not designating ELS cotton as eligible under the CFAP guidelines.  When I first heard there was going to be funds helping farmers to off cut severe losses to demand due to COVID-19, there was little doubt in my mind that ELS cotton would meet the criteria.  It was definitely a shock to read it was not included, as the price decline in the specified date range most certainly meets the 5% threshold that CFAP established as criteria for the funding. <br/><br/>Of the five commodities that we grow, no other commodity has come close to what has been lost financially in cotton due to COVID 19.   When the retail apparel industry came to a halt, so did the sale of ELS cotton.   ALL ELS cotton export sales have been stalled since March with a significant drop in shipments in mid-April.  The U.S. Census Bureau has reported a decline in ELS market of 7.2% between January 2020 and April 2020. <br/><br/> I must also add that the timing of COVID-19 just as tariffs were starting to be lifted has been crippling to our cotton farming side of business.  Because of tariffs, the ELS cotton demand was already suffering for 18 months prior to the pandemic.  With Covid-19, ELS cotton in now being turned into a larger carryover stock with higher storage and interest costs.   When adding the storage and interest cost to the 7.2% market decline,it again leaves me baffled on why it is not included in the list of commodities under the CFAP guidelines.   <br/><br/>Under the current requirements, none of the other commodities we grow (corn, wheat, alfalfa and pistachios) met the criteria due to various reasons, and it made sense as it pertains to our farming business on why they didn&rsquo;t.  But as mentioned earlier, ELS cotton does and I urge you to provide timely assistance to ELS cotton farmers through CFAP.  Thank you for your time and consideration in reading this comment.<br/><br/>Sincerely,<br/>Kelly Deftereos<br/>Deftereos Farms <br/>559-901-9850<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0816",
    "comment": "The National Cotton Council appreciates the opportunity to submit comments regarding the eligibility of additional commodities for the Coronavirus Food Assistance Program (CFAP). We respectfully urge USDA to consider the latest data for extra-long staple (ELS) cotton and expand CFAP&#39;s eligibility to include ELS producers.Please see the accompanying letter for our detailed comments.",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-0816/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-0796",
    "comment": "Hello,<br/>My name is Joseph Freitas and I am a partner in Freitas Farms 1 located in the central valley of California. Our farm produces a variety of commodities such as tomatoes, pistachios, and ELS cotton. This year, 2020, has been the most devastating year on record for our farm because of the Covid 19 pandemic and all the negative financial attributes associated with the disease. Markets have basically come to a stand still and all of our processors and marketers are unable to sell any of our products. The toughest commodity for us to sell right now is the ELS cotton, clothing retailers around the world have been been shut down or are barely getting by, forcing all the spinning mills around the world to mimic the retailers situation which in turn has assured no sales if any. Our farm like many others today are feeling the pain from this unfortunate time in our history and are asking for ELS cotton to receive the non speciality crop recognition so we can receive much needed relief at this time.<br/>Thank You for your time and attention to this important issue.<br/>Sincerely,<br/>Joseph Freitas",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0803",
    "comment": "Pafford Family Farms.   We believe that ELS cotton should be designated as a CFAP eligable  Non-specific crop  because we have been impacted greatly by the COVID-19 pandemic resulting in significant loss in the demand for ELS cotton as well as a decrease in the price for the cotton ELS cotton exports have stalled in our farm grows mostly ELS cotton and has financially stressed us please consider including ELS cotton in the program ",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0848",
    "comment": "Hello,<br/>My name is Jeremy Freitas and I am a partner in Westside Ranch located in the central valley of California. Our farm produces a variety of commodities like tomatoes, pistachios, and ELS cotton. This year, 2020, has been the most devastating for our farm because of the Covid 19 pandemic and the many negative financial consequences that followed and still persist . Markets are stagnant or negative which makes it very difficult for processors and marketers to sell any of our products. ELS cotton is one of the hardest hit commodities in our business, ELS cotton product retailers have been closed or operating at a minimal level. Demand for ELS cotton has evaporated and we are sitting on most of our 2019 crop that is still not sold.  We are having cash flow issues as a result which are having a huge negative impact on our business operations .  Our farm like many others today are feeling the pain from this unfortunate time in our history and are asking for ELS cotton to receive the non speciality crop recognition so we can receive much needed relief at this time.<br/>Thank You for your time and attention to this important issue and God Bless our Farmers !! <br/>Sincerely,<br/>Jeremy Freitas",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0832",
    "comment": "<br/>My Farming operation and family have, as many others, struggled during these unprecedented times. The trade issues followed by the pandemic have took its toll on us. ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0986",
    "comment": "Attached please find a letter from Valley Gin Company requesting the expansion of CFAP eligibility to include eLS cotton.<br/><br/>Gil Jones<br/>Manager-Valley Gin Co.",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-0986/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-0891",
    "comment": "These comments are in support of designating ELS cotton a CFAP eligible Non-Specialty Crop.  My name is Kirk Gilkey, I am a third generation farmer in Corcoran California.  My family started growing ELS or Pima cotton in the mid-1990&#39;s.  ELS has bee a successful crop for our family farm over the years even though heavy regulation makes farming in California the most expensive farming venture in the world.  The Covid-19 pandemic has been responsible for a great downturn in demand for ELS cotton.  Shipments from January 2020 through today have been almost non-existent.  This fact has resulted in larger carry-over stocks, higher storage and interest expenses  According to trade data published by the US Census Bureau ELS cotton prices have declined as measured by per-pound export values by $.08 per pound or 7.2 % between January and April of 2020.The 7.2% is only the decrease in price, the added storage and interest expenses add to the problem.  This 7.2% decline is well above the 5% threshold required to be eligible for CFAP.  Family farmers like mine will be in big trouble with our 2019/20 ELS crop without the assistance that should be provided by CFAP.  Please reconsider American ELS and approve ELS as an eligible CFAP Non-Specialty Crop.  Thanks You..",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0913",
    "comment": "6/17/2020<br/><br/>RE: Designation of ELS cotton as a CFAP Eligible Non- Specialty Crop<br/><br/>To whom it may concern,<br/><br/>I am writing today to request that the USDA designate ELS cotton as a CFAP eligible Non-Specialty Crop.  <br/><br/>I, along with my wife and three small children, own a small family farm in the central valley of California.  We grow Supima cotton, alfalfa, corn, wheat, and pistachios.  We have no employees and farm approximately 300 acres.<br/><br/>The effects of COVID 19 on our farming operation have been profound.  Of all of the commodities that we grow cotton has suffered the worst. Because of tariffs, the demand for Extra Long Staple (ELS) cotton was already suffering for 18 months prior to the pandemic.  As the pandemic progressed the retail apparel industry has been completely disrupted, and the effect on the cotton market has been disastrous.  Export sales have stalled, resulting in larger carryover stocks, and higher interest and storage costs.  ELS cotton prices, as measured by per-pound export values have declined by 8 cents per pound, or 7.2% between January and April, and they continue to fall.  This coupled with higher storage, interest, and marketing, drives that decline to almost 11 cents per pound.  <br/><br/>The small amount of assistance we received as a result of the tariffs provided some relief to a market that was already tumultuous.  I was shocked to hear that the USDA did not designate ELS cotton as CFAP eligible.  It most definitely meets the 5% threshold that was established as a criterion for funding.  I can only assume that it was a mistake by USDA and I urge you to correct this mistake immediately.  ELS producers are in dire need of the assistance that USDA can provide.<br/><br/>Please review the impact to the ELS market and amend the eligible commodities to include Extra Long Staple cotton.  <br/><br/>Thank you for your consideration of this matter.<br/><br/>Regards,<br/><br/>Nick Deftereos<br/>Deftereos Farms<br/>11660 7th Avenue<br/>Hanford, CA.  93230<br/>559-901-6951<br/>nickdeftereos@hotmail.com<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0994",
    "comment": "RE: Designation of ELS cotton as a CFAP Eligible Non-Specialty Crop<br/><br/>To Whom It May Concern:<br/><br/>My name is Bill Goodman and I am a third generation farmer of a small family owned farm of 350 acres. I farm ELS cotton and alfalfa. The COVID 19 pandemic has resulted in a significant loss in demand for ELS cotton.  The retail industry has been completely disrupted because of this pandemic which has resulted in larger carryover stocks, and higher storage and interest costs. ESL cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April.<br/><br/>Trade data published by the U.S. Census Bureau indicate a decline in ESL market prices between January 2020 and April 2020. ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. The latest price decline meets the 5% threshold established in CFAP over this timeframe.<br/><br/>With decreased demand and delayed shipments, growers like me are facing higher storage and interest charges.  When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents which will have a negative impact on my ability to pay my bills and continue farming.<br/><br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.<br/><br/>Thank You,<br/>Bill Goodman, Will-Shar Farms<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0993",
    "comment": "Dear Friends,<br/>My name is Don Palla . My wife and I are 3rd generation farmers from Buttonwillow Calif. We are small farmers, less than 500 acres. We grow 2 crops, Alfalfa Hay and Supima Cotton.   The trade situation with China and now the Covid-19 Pandemic and shutdown, has devastated my bottom line. I am struggling  to keep my head above water. I was fortunate to have a small reserve, but those funds are rapidly depleting.   I was beyond disappointed that ELS Cotton and Alfalfa Hay did not meet requirements for government help. Frankly, I have no idea why. I am hoping it was just an oversite.  Please reconsider your list. I am sure after re-evaluating the issues, you will designate ELS Cotton and Alfalfa Hay as eligible.<span style='padding-left: 30px'></span>THANK YOU and God Bless.  Don Palla",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0897",
    "comment": "See attached file(s). This ELS Cotton to be included in CFAP",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-0897/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-0979",
    "comment": "Covid 19 has really effected my operation due to lower prices for Pima cotton.  ",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0910",
    "comment": "I am a small third generation family farmer in the Central Valley of California.  Because of the high labor costs and state regulations I chose to plant ELS cotton. Due to the significant impact of the COVID-19 pandemic there has been a significant loss in demand for ELS cotton.  The retail apparel industry has been completely disrupted.  ELS cotton export sales have stalled since March and shipments dropped off significantly in April.  The latest decline meets the 5% threshold established in CFAP over the appropriate timeframe.  Given the current situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.  Sincerely - Joe &amp; Robin Maiorino",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-0965",
    "comment": "We are submitting these comments in support of the USDA designating ELS cotton as a CFAP eligible non-specialty crop.<br/> <br/>Since the start of the coronavirus outbreak, no economic sector has been affected more than apparel and home linen retail sales. This is particularly true given that the outbreak started in China, which is the largest producer of ELS products worldwide and the largest consumer of U.S. ELS cotton. Problems with China, carried over from the trade war, began as soon as the pandemic started in that country with immediate shutdowns of production facilities. This was quickly followed by the shutting down of almost all textile production facilities and retail outlets worldwide.<br/> <br/>As might be expected, this has had dire consequences for ELS growers in the U.S., the largest exporter of ELS cotton in the world. More than any other commodity, sales have all but stopped since February. The entire supply chain is faced with little liquidity at any price and the little business concluded has occurred at prices well below production costs. In addition, unlike growers of upland cotton, ELS growers are having to pay for the cost to carry this inventory with no alternatives available. When added together, price loss, carry charges, and a slow recovery of demand with little hope of price appreciation for the rest of the year, ELS growers are facing conditions that the CFAP was designed to help. Furthermore, there is another crop in the ground that will be harvested this fall and add to the burdensome inventory. Given the different levels of government program support than upland cotton growers, ELS growers are facing a greater hardship than upland cotton growers.<br/> <br/>Because the current loan program does not help growers with carry charges, ELS growers are seeing reduced net pricing weekly as storage charges continue to accrue with no relief in sight. The upland grower has relief from storage via the marketing loan mechanism when prices fall. The Pima grower is at a distinct and unanticipated disadvantage due to the COVID-19 consumption reductions and delays. When and if the textile supply chain returns to normal, the ELS grower will have seen a continuous decline in net prices beyond anything experienced before. Your program represents the only possible help in relieving this adverse economic reaction to a global problem.  ",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1006",
    "comment": "Our urgent request to include ELS cotton in CFAP",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-1006/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-1000",
    "comment": "Please include Pima cotton in the CFAP program.  Don&rsquo;t understand why it wasn&rsquo;t.  What makes it so different than Upland cotton.  Thank you in advance.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1173",
    "comment": "Please support ELS (Pima) cotton in this program, as I grow all ELS cotton and to date there is no assistance for ELS cotton  ",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1187",
    "comment": "Western Cotton Shippers Association:  Comments Attached",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-1187/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-1198",
    "comment": "American Cotton Shippers Association:  Comments Attached",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-1198/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-1683",
    "comment": "I am writing you today to request that the USDA designate ELS cotton as a CFAP eligible Non-Specialty Crop.  My name is Jonathan Andrews and I am a member in our family farm in the Central Valley of California.  Cotton, along with ELS cotton, is our primary crop grown.  The COVID crisis has disrupted the markets for many agricultural commodities and ELS cotton has been impacted as well.  I believe that ELS cotton should be designated as a CFAP eligible Non-Specialty crop for the following reasons:<br/>1.  The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton.  The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>2.  This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs.<br/>3.  ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid April<br/>4.  Trade data published by U.S. Census Bureau indicates a decline in ELS market prices between January 2020 and April 2020.  ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April.<br/>5.  The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe.<br/>6.  With decreased demand and delayed shipments, growers are facing higher storage and interest charges.  When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs in 10.7 cents.<br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.  Thank you for your consideration.<br/>Sincerely,<br/>Jonathan Andrews<br/>J.A. Andrews Farms, LLC<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1687",
    "comment": "My name is Kenneth Claridge.  I am a grower of Extra Long Staple Cotton. I reside in Safford Arizona, Graham county. About 50% of the cotton grown in this area is ELS. My family has been a producer of long staple cotton all of my life.  In the last 25 years, ELS Cotton has been at least 95% of my farm income.  Since Covid-19, my crop has been drastically affected. My cotton is still sitting in a warehouse not being sold due to the shrinking world demand which has resulted in record low prices of ELS cotton. The price of cotton is below the cost of production. Prices continue to fall while the cost of producing keeps increasing. With decreased demand and delayed shipment, we as growers are facing higher storage and interest charges.  The overall impact of lower prices and increased marketing costs are devastating. Given this current economic situation, I strongly encourage the USDA to designate ELS cotton as a CFAP eligible Non-Specialty Crop. We as growers of Long Staple Cotton are in dire need of the timely assistance that can be provided through CFAP.<br/>-Kenneth Claridge, ELS Cotton Grower, Safford Arizona",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1456",
    "comment": "Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1468",
    "comment": "We would like to request that the USDA designate ELS cotton as a CFAP eligible Non-Specialty Crop. My name is John Newton and I am a partner in a family partnership called Newton Farms. Our partnership is made up of 4 Newton families which includes my three cousins and I. We have been farming this same land since 1911 and now the 4th Newton generation is now joining us. ELS Cotton is a major contribution to the continues success of our livelihood.",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-1468/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-1259",
    "comment": "I am writing this request with the purpose of USDA designating ELS cotton as a CFAP eligible non-specialty crop.  I farm a few hundred acres of which 50% is dedicated to growing ELS cotton.  I have personally been effected by the COVID-19 pandemic through the significant loss of demand for ELS cotton.  Shipping ports have been closed, spinning and yarn mills have been closed, and ELS cotton export sales have become virtually non existent.  Trade data published by the US Census Bureau indicate a decline in ELS cotton market prices of approximately 7.2 % between January and April of 2020.  This price decline meets and even exceeds the 5% threshold established in CFAP over the appropriate time frame.  Synthetic fibers (petroleum based) have become less expensive to manufacture due to the oil prices being  so historically low this year, which gives synthetics an unfair advantage in this distorted market.  The pandemic is creating added expense for me personally by having to pay for storage of my cotton crop in order to try to hold it until prices become more favorable. Given the current economic situation ELS cotton producers are in need of timely assistance that can be provided through CFAP.  <br/>Sincerely, <br/>A 5th generation farmer",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1270",
    "comment": "I respectfully ask USDA to include ELS Cotton in the 2019 CFAP program as the loss in market share exceeds the 5% loss thresholds set forth for upland cotton.  Declining shipping and market access due to the Covid pandemic has resulted in a loss in price of over 7%.  This has and continues to put pressure on producers by increasing interest and storage cost by not being able to timely market their ELS cotton.   I ask on behalf of all producers that this commodity be added to the list of eligible crops.  The American family farmers and the businesses that depend on use have all been affected and we must help them through this process of working through this unexpected event.  Our rural communities depend on the family farmer and our urban cities depend on rural America for all their basic needs even if they don&rsquo;t realize it.  The American farmer feeds and cloths this great nation and much consideration must be given to the financial health of this great industry. Thank you in advance for including ELS cotton in the 2019 CFAP program.  ",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1307",
    "comment": "Please designate ELS cotton as a CFAP eligible Non-\u2028Specialty Crop<br/>Family Farm<br/><br/>The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic. This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs.<br/>ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April.Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020.  ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April.  <br/>The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. <br/> With decreased demand and delayed shipments, growers are facing higher storage and interest charges.  When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents.<br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP<br/><br/>Thank you, <br/><br/>Danae Netto Koprivetz ",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1312",
    "comment": "to whom it may concern:<br/>I am writing today to request that the USDA designate ELS cotton as a CFAP eligible  Non Specialty crop. <br/>My name is Norman Shepherd and I am the President of My family&#39;s farming operation in the Central valley of California.<br/>We are a third generation California farm family and have been farming the same land for over  seventy years.<br/>ELS cotton is one of our primary crops along with almonds. During the COVID crisis there has been considerable focus on our food supply<br/>yet many of us grow food and fiber crops in our rotations. While we enjoy using cotton in our daily lives, much of it is produced in regions that don&#39;t<br/>protect their workers or environment. California has high regulatory standards with enforceable penalties that back them up. The COVID crisis has disrupted<br/>the markets for many agricultural commodities and ELS cotton has been impacted as well.<br/>I believe that ELS cotton should be designated as a CFAP eligible Non Specialty crop for the following reasons:<br/>The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. the retail apparel has been completely<br/>disrupted because of the pandemic.<br/>this reduction caused larger carryover stock and higher storage cost and interest costs as well.<br/>Given the current economic situation, ELS producers are in dire need of timely assistance that can be provided through CFAP.<br/>Thank you for your consideration.<br/><br/>Sincerely,<br/>Norman shepherd<br/>president<br/>Norman Shepherd farm<br/><br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1635",
    "comment": "* I urge USDA to designate ELS cotton as a CFAP eligible Non-Specialty crop.<br/>* I have been farming ELS cotton for over 40 years.<br/>* The COVID-19 pandemic has resulted in a price drop that meets the 5% threshold established in CFAP over the appropriate time frame, Jan. to April 2020.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1258",
    "comment": "Please see the attached file as our submission of comment for the inclusion of eligibility for ELS Cotton producers under the Coronavirus Food Assistance Program comment period for additional commodities.",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-1258/attachment_1.pdf"
    ]
  },
  {
    "id": "FSA-2020-0004-1393",
    "comment": "Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1395",
    "comment": "Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1399",
    "comment": "Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1392",
    "comment": "Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1396",
    "comment": "Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1524",
    "comment": "Lorenzetti Properties<br/>P.O. Box 155<br/>Dos Palos, Ca. 93620<br/>(209)392-3165<br/>d_lorenzetti@comcast.net<br/><br/>RE: Designation of ELS Cotton as a CFAP Eligible Non-Specialty Crop<br/><br/>To Whom It May Concern:<br/>Imagine our concern and surprise upon hearing that ELS Cotton was not being recognized as a qualified crop for the CFAP Program. With the market already flat as the trade wars continue this is just another blow to farmers. Already challenged by low prices, government restrictions, and high costs COVID-19 has put additional stress on an already struggling market. We simply cannot afford to be left out of any assistance program.<br/>I ask you to consider the following reasons as well as the ones stated above and reconsider your decision regarding the ELS Cotton designation.<br/>I believe that ELS cotton should be designated as a CFAP eligible Non-Specialty crop for the following<br/>reasons:<br/>● The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel<br/>industry has been completely disrupted because of the COVID-19 pandemic.<br/>● This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage<br/>and interest costs.<br/>● ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in<br/>mid-April.<br/>● Trade data published by U.S. Census Bureau indicates a decline in ELS market prices between January<br/>2020 and April 2020. ELS cotton prices, as measured by per-pound export values declined by $0.08 per<br/>pound, or 7.2% between January and April.<br/>● The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe.<br/>● With decreased demand and delayed shipments, growers are facing higher storage and interest charges.<br/>When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents.<br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be<br/>provided through CFAP. Thank you for your consideration.<br/><br/>Dino Lorenzetti<br/>Partner - Lorenzetti Properties<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1529",
    "comment": "Cardella-Fundus Farms Trust<br/>39984 W. North Ave.<br/>Mendota, Ca. 93640<br/>(209)655-4216<br/>cardellaranch@gmail.com<br/><br/>RE: Designation of ELS Cotton as a CFAP Eligible Non-Specialty Crop<br/><br/>To Whom It May Concern:<br/>Imagine our concern and surprise upon hearing that ELS Cotton was not being recognized as a qualified crop for the CFAP Program. With the market already flat as the trade wars continue this is just another blow to farmers. Already challenged by low prices, government restrictions, and high costs COVID-19 has put additional stress on an already struggling market. We simply cannot afford to be left out of any assistance program.<br/>I ask you to consider the following reasons as well as the ones stated above and reconsider your decision regarding the ELS Cotton designation.<br/>I believe that ELS cotton should be designated as a CFAP eligible Non-Specialty crop for the following<br/>reasons:<br/>● The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel<br/>industry has been completely disrupted because of the COVID-19 pandemic.<br/>● This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage<br/>and interest costs.<br/>● ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in<br/>mid-April.<br/>● Trade data published by U.S. Census Bureau indicates a decline in ELS market prices between January<br/>2020 and April 2020. ELS cotton prices, as measured by per-pound export values declined by $0.08 per<br/>pound, or 7.2% between January and April.<br/>● The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe.<br/>● With decreased demand and delayed shipments, growers are facing higher storage and interest charges.<br/>When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents.<br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be<br/>provided through CFAP. Thank you for your consideration.<br/><br/>Rod Cardella<br/>President - Cardella-Fundus Farms Trust<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1236",
    "comment": "Hello,<br/><br/>I am a third generation farmer in the Central Valley of California. We run a family farm operation that includes growing ELS cotton.  I am writing to request that the USDA designate ELS cotton as a CFAP eligible non-specialty crop.  I was disheartened to learn that ELS cotton was not determined eligible when it clearly meets the CFAP requirement of a 5% or more decline in market price due to the impact of COVID-19 - the decline is actually more than 7% between January 2020 and April 2020.  CFAP funds have been earmarked for the purpose of providing financial relief to farmers impacted by price decline and additional marketing costs for inventories due to the COVID-19 pandemic.  ELS cotton meets the price decline criterion and the intended purpose of CFAP relief.  Due to COVID-19, the apparel and textile industry, including exports, have came to screeching halt.  This has increased the supply to levels never previously contemplated.  Additionally, there are minimal alternative markets for ELS cotton outside of textiles and apparel and none that able to provide any meaningful impact on oversupply and market price.  Global markets are also not viable alternatives as exports have essentially stalled since March.  The increased marketing and storage costs result in an even greater loss to farmers on top of the substantially lower market price.  <br/><br/>The USDA should also consider the parallel of the designation of wool as a CFAP eligible non-specialty crop.  Similar to ELS cotton, wool is used for textiles and apparel and market price is significantly effected by export markets.  However, for some reason, wool was designated as CFAP eligible while ELS cotton was not, despite the fact that ELS cotton meets both the 5% or more market price decline and additional marketing costs criteria outlined in the CFAP. <br/><br/>Based on the above and with the consideration of the thousands of small family farms that this decision directly affects, I humbly request that the USDA reconsiders its decision to not designate ELS cotton as a CFAP eligible non-specialty crop. <br/><br/>Respectfully, <br/><br/>Diandra Netto Vantrease <br/>Netto West Farming ",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1384",
    "comment": "I have farmed cotton for over 40 years. My father, and grandfather before that. Growing pima is a challenge it&#39; self. Never in three generations have we faced the economic impact that we are facing today. Last year &#39;1019&#39; was one of the lowest yielding years we have had in recent history. Now we are looking at $1.00 - 1.05 per lb. when we were getting $1.40 - 1.50 per lb. the tariffs are affecting us badly. China is one of our major export countries. For this reason I think that pima cotton should be included in the CFAC program.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1341",
    "comment": "To whom it may concern, <br/>I am David Pafford, a sole proprietor farming in the San Joaquin Valley. I operate 700 acres, and my primary crop is ELS cotton. Although other members of my extended family farm, I am a rarity in that I saved up the money to start farming myself from scratch, working other jobs until in my early 40s while living well below our means. I invested my entire life savings at that point in life to run my own farming operation. <br/>&bull;<span style='padding-left: 30px'></span>I am writing to urge USDA to designate ELS cotton as a CFAP eligible Non-Specialty Crop<br/>I was surprised to see ELS left off the list of commodities supported by CFAP, and believe this was an unjustifiable oversight for the following reasons:<br/>o<span style='padding-left: 30px'></span>The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>o<span style='padding-left: 30px'></span>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs.<br/>o<span style='padding-left: 30px'></span>ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April.<br/>o<span style='padding-left: 30px'></span>Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020.  ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April.  <br/>o<span style='padding-left: 30px'></span>The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. <br/>o<span style='padding-left: 30px'></span>With decreased demand and delayed shipments, growers are facing higher storage and interest charges.  When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents.<br/>&bull;<span style='padding-left: 30px'></span>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1389",
    "comment": "My family Has depends on farming and have been farming for 6 generations now. It has been our life&rsquo;s work and Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1390",
    "comment": "We depend on AG and farmers! As a farmer daughter I have seen the trails and tribulations and Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1391",
    "comment": "I am a proud farmer daughter and Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1394",
    "comment": "Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1398",
    "comment": "Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1397",
    "comment": "Farming has always been a struggle there always seems to be new rules and regulations that put the odds against us. This pandemic and traded issues have really been a detriment to our financial stability. Please consider including ELS In this program. Here are a few examples I hope this does not fall on deaf ears thank you￼.￼￼￼<br/><br/>ELS cotton should be included in this program. The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage and interest costs. ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in mid-April. Trade data published by U.S. Census Bureau provide indicate a decline in ELS market prices between January 2020 and April 2020. &nbsp;ELS cotton prices, as measured by per-pound export values declined by $0.08 per pound, or 7.2% between January and April. &nbsp;The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. With decreased demand and delayed shipments, growers are facing higher storage and interest charges. &nbsp;When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents. Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1473",
    "comment": "We are writing to urge USDA to designate ELS cotton as a CFAP eligible Non-Specialty Crop for the following reasons:<br/> <br/>The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>This reduction in demand for ELS cotton has resulted in larger carryover stocks, higher storage costs and increased interest costs.<br/>ELS cotton export sales have stalled since March, while shipments dropped off significantly in mid-April.<br/>Trade data published by U.S. Census Bureau indicate a decline in ELS market prices between January 2020 and April 2020.  ELS cotton prices, as measured by per-pound export values, declined by $0.08 per pound or 7.2% between January and April.  <br/>The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. <br/> With decreased demand and delayed shipments, growers are also facing higher storage and interest costs.  When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents.<br/> <br/>Our family are third generation farmers who have been operating in California&rsquo;s central San Joaquin Valley for over 50 years.  We currently grow ELS cotton, processing tomatoes, onions, almonds and pistachios.<br/> <br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1462",
    "comment": "We are writing to urge USDA to designate ELS cotton as a CFAP eligible Non-Specialty Crop for the following reasons:<br/><br/>o<span style='padding-left: 30px'></span>The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel industry has been completely disrupted because of the COVID-19 pandemic.<br/>o<span style='padding-left: 30px'></span>This reduction in demand for ELS cotton has resulted in larger carryover stocks, higher storage costs and increased interest costs.<br/>o<span style='padding-left: 30px'></span>ELS cotton export sales have stalled since March, while shipments dropped off significantly in mid-April.<br/>o<span style='padding-left: 30px'></span>Trade data published by U.S. Census Bureau indicate a decline in ELS market prices between January 2020 and April 2020.  ELS cotton prices, as measured by per-pound export values, declined by $0.08 per pound or 7.2% between January and April.  <br/>o<span style='padding-left: 30px'></span>The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe. <br/>o<span style='padding-left: 30px'></span>With decreased demand and delayed shipments, growers are also facing higher storage and interest costs.  When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents.<br/><br/>Our family are third generation farmers who have been operating in California&rsquo;s central San Joaquin Valley for over 50 years.  We currently grow ELS cotton, processing tomatoes, onions, almonds and pistachios.<br/><br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be provided through CFAP.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1532",
    "comment": "ArmasCardella<br/>8646 N. Bond<br/>Fresno, Ca. 93720<br/><br/>RE: Designation of ELS Cotton as a CFAP Eligible Non-Specialty Crop<br/><br/>To Whom It May Concern:<br/>Imagine our concern and surprise upon hearing that ELS Cotton was not being recognized as a qualified crop for the CFAP Program. With the market already flat as the trade wars continue this is just another blow to farmers. Already challenged by low prices, government restrictions, and high costs COVID-19 has put additional stress on an already struggling market. We simply cannot afford to be left out of any assistance program.<br/>I ask you to consider the following reasons as well as the ones stated above and reconsider your decision regarding the ELS Cotton designation.<br/>I believe that ELS cotton should be designated as a CFAP eligible Non-Specialty crop for the following<br/>reasons:<br/>● The COVID-19 pandemic has resulted in a significant loss in demand for ELS cotton. The retail apparel<br/>industry has been completely disrupted because of the COVID-19 pandemic.<br/>● This reduction in the demand for ELS cotton has resulted in larger carryover stocks, and higher storage<br/>and interest costs.<br/>● ELS cotton export sales have virtually stalled since March while shipments dropped off significantly in<br/>mid-April.<br/>● Trade data published by U.S. Census Bureau indicates a decline in ELS market prices between January<br/>2020 and April 2020. ELS cotton prices, as measured by per-pound export values declined by $0.08 per<br/>pound, or 7.2% between January and April.<br/>● The latest price decline meets the 5% threshold established in CFAP over the appropriate timeframe.<br/>● With decreased demand and delayed shipments, growers are facing higher storage and interest charges.<br/>When added to the market decline of 8 cents, the overall impact of lower prices and increased marketing costs is 10.7 cents.<br/>Given the current economic situation, ELS producers are in dire need of the timely assistance that can be<br/>provided through CFAP. Thank you for your consideration.<br/><br/>Rod Cardella<br/>Partner - ArmasCardella<br/>",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1664",
    "comment": "Extra long staple cotton is an important crop in the U S A.  We should be included in the C F A P program asour sister cottons have been. We have suffered<br/>a large marketing loss due to the effects of covid-19. Our industry is suffering along with everybody else and would appreciate any help that we can get.",
    "attachments": []
  },
  {
    "id": "FSA-2020-0004-1650",
    "comment": "Please see the attached document requesting for CFAP eligibility for ELS cotton.",
    "attachments": [
      "https://downloads.regulations.gov/FSA-2020-0004-1650/attachment_1.docx"
    ]
  },
  {
    "id": "FSA-2020-0004-1660",
    "comment": "I&#39;m writing to support the inclusion of Extra Long Staple Cotton (ELS/Pima) into the CFAP program.<br/><br/>I am the CEO of Calcot, a cotton marketing cooperative with ELS growers in California, Arizona, New Mexico, and Texas. We have seen a dramatic price decline in ELS cottons due to demand destruction as a result of the coronavirus. <br/><br/>Prices at this time last year were in the $1.15 to $1.20 per pound range, net to the grower. Current prices are at or below loan levels, between 90 and 95 cents per pound. The price decline is due almost entirely to the lack of demand for ELS fiber.<br/><br/>We urge USDA to include CFAP assistance for ELS growers as it did for upland cotton growers. Thank you for your attention to this matter.<br/><br/>Sincerely,<br/><br/>Paul E Bush<br/>President &amp; CEO<br/>Calcot, LTD.",
    "attachments": []
  }
]